historic/moonshot-samples/C36N1/results/randread-002-2k.fio.out
randread-2k: (g=0): rw=randread, bs=2K-2K/2K-2K/2K-2K, ioengine=libaio, iodepth=10
fio-2.1.3
Starting 1 process

randread-2k: (groupid=0, jobs=1): err= 0: pid=29957: Fri May 27 17:59:31 2016
  read : io=11001MB, bw=187752KB/s, iops=93875, runt= 60001msec
    slat (usec): min=1, max=604, avg= 4.28, stdev= 6.40
    clat (usec): min=7, max=82693, avg=100.85, stdev=117.75
     lat (usec): min=33, max=82698, avg=105.25, stdev=117.90
    clat percentiles (usec):
     |  1.00th=[   71],  5.00th=[   78], 10.00th=[   80], 20.00th=[   85],
     | 30.00th=[   88], 40.00th=[   91], 50.00th=[   94], 60.00th=[   98],
     | 70.00th=[  102], 80.00th=[  108], 90.00th=[  121], 95.00th=[  139],
     | 99.00th=[  286], 99.50th=[  326], 99.90th=[  478], 99.95th=[  604],
     | 99.99th=[ 1320]
    bw (KB  /s): min=41892, max=194264, per=99.94%, avg=187645.95, stdev=14447.48
    lat (usec) : 10=0.01%, 20=0.01%, 50=0.28%, 100=64.48%, 250=34.05%
    lat (usec) : 500=1.10%, 750=0.05%, 1000=0.01%
    lat (msec) : 2=0.02%, 4=0.01%, 10=0.01%, 20=0.01%, 100=0.01%
  cpu          : usr=19.30%, sys=52.97%, ctx=1484200, majf=0, minf=13
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=100.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=5632645/w=0/d=0, short=r=0/w=0/d=0

Run status group 0 (all jobs):
   READ: io=11001MB, aggrb=187751KB/s, minb=187751KB/s, maxb=187751KB/s, mint=60001msec, maxt=60001msec

Disk stats (read/write):
  nvme0n1: ios=5628142/4, merge=0/0, ticks=500568/92, in_queue=499768, util=99.95%